kizua_mwangola/part_3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-02 Fri 10:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kizua Mwangola: Part 3: Huambo</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Kizua Mwangola: Part 3: Huambo</h1>
<p>
<a href="index.html">back to chapter index.</a>
</p>

<p>
Monday, December 07, 2009
</p>

<p>
Things ended up going quite well with the conservatoria in the end. It
sure didn't look like it in the beginning though. We got there around
07:00 AM on the dot, thinking this was early enough &#x2014; I should have
known better. The fall of Saigon had less people roaming
around. Nevertheless, it was an instructive day as we figured out all
the requirements to get things done. Next day I turned up at 05:10 AM,
and was still number 12 in the queue (!!) but managed to put my
request in. On the plus side, I was out by 09:30 AM.
</p>

<p>
Since it would take 5 working days to pick up the finished articles
(e.g. the cedula and birth certificate), we decided to trek to Huambo
to visit Cousin R. This is Angola's equivalent of Namibia's Windhoek,
as it sits more or less on the centre of the country. Many years ago,
the Portuguese had ambitions of making Huambo the capital of the
empire; they called it Nova Lisboa. Due to its strategic importance
and proximity to the rebels home ground, Huambo and the surrounding
areas got shelled intensively during the war, particularly during the
late nineties.
</p>

<p>
These days, the city is a recovering place. It still displays many
scars of the recent past, but it also sports a great deal of rebuilt
infrastructure. The government sees Huambo and the surrounding areas
(such as Cela in Wako Kungo) as key for the agricultural revival the
nation requires. Angola imports around 80% of what it consumes, a lot
of which are cereals and other agricultural products. This is all the
more amazing when one travels through the fertile lands of the
plateau, kilometres and kilometres of greenery and very little of it
affected by human hand. Imagine something like Hertfordshire but with
unspoilt nature instead of farms and then scale that to a Britain-like
size and you get close. Excluding the landmines, of course.
</p>

<p>
After a difficult bus trip, we spent 5 days in great luxury at cousin
R's pad, with all the mod-coms. During the day we treked the city,
visiting places like the granja, and meeting nice people such as
Hugo. Time went far too quickly, and we had to go back to the madness
of Luanda.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="part_2.html">Back to previous chapter</a></td>
<td class="org-left"><a href="index.html">Back to chapter index.</a></td>
<td class="org-left"><a href="part_4.html">Forward to next chapter</a></td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-02 Fri 10:15</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
